In [1]:
import numpy as np
import pandas as pd

In [2]:
d = {'A':[1,2,np.nan], 'B':[5,np.nan, np.nan], 'C':[1,2,3]}

In [3]:
df = pd.DataFrame(d)

In [5]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [8]:
df.dropna() #drops any rows that have 1 or more NaN values

     A    B  C
0  1.0  5.0  1

In [11]:
df.dropna(axis=1) #axis =1 drops columns of NaN values

   C
0  1
1  2
2  3

In [13]:
df.dropna(thresh=2) #so drop any rows that have NaN values 2 or more

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [15]:
df.fillna(value='FILL VALUE') #fills all the NaN values with FILL VALUE

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [17]:
df['A'].fillna(value=df['A'].mean()) #fills the missing values with the mean of that column

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64